app/controllers/api/servers_controller.rb

    def show
        @server = Server.find_by(id: params[:id])
        if get_all_servers(current_user).include?(@server)
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @server = Server.new(server_params)
        @server.owner_id = current_user.id

        if @server.save!
---
INSERT INTO "servers" ("server_name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["server_name", "server4"], ["owner_id", 1], ["created_at", "2020-08-21 17:24:56.746626"], ["updated_at", "2020-08-21 17:24:56.746626"]]

    def update
        @server = Server.find(params[:id])
        if @server.owner_id == current_user.id && @server.update(server_params)
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "servers" SET "server_name" = $1, "updated_at" = $2 WHERE "servers"."id" = $3  [["server_name", "server4updated"], ["updated_at", "2020-08-21 17:34:33.118831"], ["id", 5]]

    def destroy
        @server = Server.find(params[:id])
        if @server.owner_id == current_user.id
            @server.destroy
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "servers" WHERE "servers"."id" = $1  [["id", 1]]

    def leave
        @server = current_user.joined_servers.find(params[:id])
---
SELECT "servers".* FROM "servers" INNER JOIN "user_servers" ON "servers"."id" = "user_servers"."server_id" WHERE "user_servers"."user_id" = $1  [["user_id", 1]]